1s/ERP/Conf/Documents/Лико_ВыполненныеРаботыМеждуОрганизациями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ВыполненныеРаботыМеждуОрганизациями</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадкаПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадкаПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыДокументаЛико_АктВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоглашениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартнерПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Служебный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_БланкЭтапа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоглашениеПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоглашениеПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоглашениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоглашениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПартнерПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПартнерПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПлощадкаПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлощадкаПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыДокументаЛико_АктВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыДокументаЛико_АктВыполненныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаДанныхДляЗаполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ВыполненныеРаботыМеждуОрганизациями/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ОрганизацияПоставщика;
	
КонецПроцедуры


 Процедура ОбработкаПроведения(Отказ, Режим)
	
	УдалениеТиповыхДокументов(Отказ);
	СформироватьДвижения();
	СформироватьТиповыеДокументы();
	УстановитьЦеныВзаказахКлиента();
	
КонецПроцедуры 


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	УдалениеТиповыхДокументов(Отказ);
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

Процедура СформироватьДвижения() 
	
	СформироватьЛико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены();

КонецПроцедуры 

Процедура СформироватьЛико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены() 
	Движения.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.Записывать = Истина;

	Если ВидДокумента = Перечисления.Лико_ВидыДокументаЛико_АктВыполненныхРабот.УстановкаДанныхДляЗаполнения Тогда
		Для Каждого ТекСтрокаЦены Из Цены Цикл
			Движение = Движения.Лико_ВыполненныеРаботыМеждуОрганизациямиРаботыИЦены.Добавить();
			Движение.Период = Дата;
			Движение.ПлощадкаПоставщика = ПлощадкаПоставщика;
			Движение.ПлощадкаПокупателя = ПлощадкаПокупателя;
			
			ЗаполнитьЗначенияСвойств(Движение,ТекСтрокаЦены);
			ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры 

Процедура СформироватьТиповыеДокументы() 
	
Если ВидДокумента = Перечисления.Лико_ВидыДокументаЛико_АктВыполненныхРабот.АктВыполненныхРабот Тогда
	
	Обработки.АктВыполненныхРаботДоп.СформироватьДокумент(ЭтотОбъект);  
	Обработки.ПриобретениеУслугПрочихАктивовДоп.СформироватьДокумент(ЭтотОбъект);
	
КонецЕсли;

КонецПроцедуры

Процедура УдалениеТиповыхДокументов(Отказ)
	
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("АктВыполненныхРабот","Лико_Документ",Ссылка,Отказ);
	Лико_ОбщегоНазначенияСервер.НайтиДокументИПометитьНаУдаление("ПриобретениеУслугПрочихАктивов","Лико_Документ",Ссылка,Отказ);
	
	
КонецПроцедуры 

Процедура УстановитьЦеныВЗаказахКлиента()
	
	Если ВидДокумента = Перечисления.Лико_ВидыДокументаЛико_АктВыполненныхРабот.АктВыполненныхРабот Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Регистратор.ЗаказПокупателя КАК Заказ,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВтРаботы
		|ИЗ
		|	Документ.Лико_ВыполненныеРаботыМеждуОрганизациями.Работы КАК Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы
		|ГДЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиРаботы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.Цена КАК Цена,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.СтавкаНДС КАК СтавкаНДС,
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.ЦеноваяГруппа КАК ЦеноваяГруппа
		|ПОМЕСТИТЬ ВтЦены
		|ИЗ
		|	Документ.Лико_ВыполненныеРаботыМеждуОрганизациями.Цены КАК Лико_ВыполненныеРаботыМеждуОрганизациямиЦены
		|ГДЕ
		|	Лико_ВыполненныеРаботыМеждуОрганизациямиЦены.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВтРаботы.Заказ КАК Заказ,
		|	ВтРаботы.Номенклатура КАК Номенклатура,
		|	ВтРаботы.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВтЦены.СтавкаНДС КАК СтавкаНДС,
		|	ВтЦены.Цена КАК Цена
		|ПОМЕСТИТЬ ВтЗаказЦены
		|ИЗ
		|	ВтРаботы КАК ВтРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЦены КАК ВтЦены
		|		ПО ВтРаботы.ЦеноваяГруппа = ВтЦены.ЦеноваяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтЗаказЦены.Заказ КАК Заказ,
		|	ВтЗаказЦены.Номенклатура КАК Номенклатура,
		|	ВтЗаказЦены.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ВтЗаказЦены.СтавкаНДС КАК СтавкаНДС,
		|	ВтЗаказЦены.Цена КАК Цена,
		|	ЗаказКлиентаТовары.Цена КАК ЦенаЗаказа,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДСЗаказа
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЗаказЦены КАК ВтЗаказЦены
		|		ПО ЗаказКлиентаТовары.Ссылка = ВтЗаказЦены.Заказ
		|			И ЗаказКлиентаТовары.Номенклатура = ВтЗаказЦены.Номенклатура
		|ГДЕ
		|	(ВтЗаказЦены.Цена <> ЗаказКлиентаТовары.Цена
		|			ИЛИ ВтЗаказЦены.СтавкаНДС <> ЗаказКлиентаТовары.СтавкаНДС)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура)
		|ПО
		|	Заказ";
		Запрос.УстановитьПараметр("Ссылка",Ссылка );
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			
			ЗаказОбъект = ВыборкаЗаказ.Заказ.ПолучитьОбъект();
			//ЗаказОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
			Выборка = ВыборкаЗаказ.Выбрать();
			Пока Выборка.Следующий() цикл
				НайтиСтрокиТоваров = ЗаказОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
				Для каждого Товар Из НайтиСтрокиТоваров Цикл 
					
					Товар.СтавкаНДС = Выборка.СтавкаНДС;
					Товар.Цена = Выборка.Цена; 
					ПараметрыРасчетаПересчитатьДанные(Дата, ЗаказОбъект.Площадка,Товар);
					
				КонецЦикла
			КонецЦикла;
			
			
			ЗаказОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказОбъект.Записать();
			
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры




Процедура ПараметрыРасчетаПересчитатьДанные(Дата, Площадка, Товар) // --> Начало Лико Яцун 14.12.2022
   // <-- Начало Лико Яцун С. В.   
	К_Дох = Лико_Планирование.ПолучитьКоэффициентНалоговВДоходности(Дата, Площадка);
	// <-- Конец Лико Яцун С. В. 

	Товар.стоимость = Товар.Цена*Товар.тираж;     
	Если ЗначениеЗаполнено(Товар.МетражКВМ) Тогда 
		Товар.ЦенаМ2 = Товар.стоимость/Товар.МетражКВМ;
    КонецЕсли;
	Товар.Доход = Товар.стоимость*К_Дох - Товар.себестоимость;   
	Если ЗначениеЗаполнено(Товар.Время) Тогда 
		Товар.Доходность = Товар.Доход/Товар.Время;    
	Иначе
		Товар.Доходность  = 0;
	КонецЕсли; 
	Если ЗначениеЗаполнено(Товар.стоимость) Тогда 
   		Товар.рентабельность= Окр(Товар.Доход/Товар.стоимость*100,2);  
	Иначе
		Товар.рентабельность = 0;
	КонецЕсли; 
	
	Товар.ЦенаБезНДС = Товар.Цена*100/120; 
	
КонецПроцедуры // <-- Конец Лико Яцун 14.12.2022 



#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
